var _citys =[
	["请选择"],
	["东城区","西城区","崇文区","宣武区","朝阳区","丰台区","石景山区","海淀区","门头沟区","房山区","通州区","顺义区","延庆县","昌平区","怀柔区","密云县","平谷区","大兴区","其它地区"],
	["和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","大港区","东丽区","西青区","津南区","北辰区","蓟县","宝坻区","武清区","宁河县","静海县","汉沽区","其它地区"],
	["石家庄市","张家口市","承德市","秦皇岛市","唐山市","廊坊市","保定市","沧州市","衡水市","邢台市","邯郸市","其它地区"],
	["太原市","大同市","朔州市","阳泉市","长治市","晋城市","忻州市","吕梁市","晋中市","临汾市","运城市","其它地区"],
	["沈阳市","朝阳市","阜新市","铁岭市","抚顺市","本溪市","辽阳市","鞍山市","丹东市","大连市","营口市","盘锦市","锦州市","葫芦岛市","其它地区"],
	["长春市","白城市","松原市","吉林市","四平市","辽源市","通化市","白山市","延边朝鲜族自治州","其它地区"],
	["黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","崇明县","青浦区","南汇区","奉贤区","其它地区"],
	["南京市","徐州市","连云港市","宿迁市","淮安市","盐城市","扬州市","泰州市","南通市","镇江市","常州市","无锡市","苏州市","淮安市","其它地区"],
	["杭州市","湖州市","嘉兴市","舟山市","宁波市","绍兴市","金华市","台州市","温州市","丽水市","衢州市","其它地区"],
	["合肥市","宿州市","淮北市","阜阳市","蚌埠市","淮南市","滁州市","马鞍山市","芜湖市","铜陵市","安庆市","黄山市","六安市","巢湖市","池州市","宣城市","亳州市","其它地区"],
	["福州市","南平市","三明市","莆田市","泉州市","厦门市","漳州市","龙岩市","宁德市","其它地区"],
	["南昌市","九江市","景德镇市","鹰潭市","新余市","萍乡市","赣州市","上饶市","抚州市","宜春市","吉安市","其它地区"],
	["济南市","聊城市","德州市","东营市","淄博市","潍坊市","烟台市","威海市","青岛市","日照市","临沂市","枣庄市","济宁市","泰安市","莱芜市","滨州市","菏泽市","其它地区"],
	["郑州市","三门峡市","洛阳市","焦作市","新乡市","鹤壁市","安阳市","濮阳市","开封市","商丘市","许昌市","漯河市","平顶山市","南阳市","信阳市","济源市","周口市","驻马店市","其它地区"],
	["呼和浩特市","包头市","乌海市","赤峰市","呼伦贝尔","兴安盟","锡林郭勒盟","乌兰察布市","巴彦淖尔市","阿拉善盟","鄂尔多斯市","通辽市","其它地区"],
	["哈尔滨市","齐齐哈尔市","黑河市","大庆市","伊春市","鹤岗市","佳木斯市","双鸭山市","七台河市","鸡西市","牡丹江市","绥化地区","大兴安岭地区","其它地区"],
	["武汉市","十堰市","襄樊市","荆门市","孝感市","黄冈市","鄂州市","黄石市","咸宁市","荆州市","宜昌市","随州市","仙桃市","天门市","潜江市","神农架林区","恩施土家族苗族自治州","其它地区"],
	["长沙市","张家界市","常德市","益阳市","岳阳市","株洲市","湘潭市","衡阳市","郴州市","永州市","邵阳市","怀化市","娄底市","湘西土家族苗族自治州","其它地区"],
	["广州市","清远市","韶关市","河源市","梅州市","潮州市","汕头市","揭阳市","汕尾市","惠州市","东莞市","深圳市","珠海市","中山市","江门市","佛山市","肇庆市","云浮市","阳江市","茂名市","湛江市","其它地区"],
	["南宁市","桂林市","柳州市","梧州市","贵港市","玉林市","钦州市","北海市","防城港市","百色市","河池市","贺州市","崇左市","凭祥市","来宾市","其它地区"],
	["海口市","三亚市","琼山市","文昌市","琼海市","万宁市","东方市","儋州市","临高县","澄迈县","定安县","屯昌县","昌江黎族自治县","白沙黎族自治县","琼中黎族苗族自治县","陵水黎族自治县","保亭黎族苗族自治县","乐东黎族自治县","五指山市","其它地区"],
	["成都市","广元市","绵阳市","德阳市","南充市","广安市","遂宁市","内江市","乐山市","自贡市","泸州市","宜宾市","攀枝花市","巴中市","达州市","资阳市","眉山市","雅安市","阿坝藏族羌族自治州","甘孜藏族自治州","凉山彝族自治州","其它地区"],
	["渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区","北碚区","万盛区","双桥区","渝北区","巴南区","万州区","涪陵区","合川市","永川市","江津市","南川市","长寿区","綦江县","潼南县","铜梁县","大足县","荣昌县","璧山县","垫江县","武隆县","丰都县","城口县","梁平县","黔江区","奉节县","开县","云阳县","忠县","巫溪县","巫山县","石柱土家族自治县","秀山土家族苗族自治县","酉阳土家族苗族自治县","彭水苗族土家族自治县","其它地区"],
	["台北市","高雄市","台南市","台中市","基隆市","新竹市","嘉义市","台北县","宜兰县","新竹县","桃园县","苗栗县","台中县","彰化县","南投县","嘉义县","云林县","台南县","高雄县","屏东县","台东县","花莲县","澎湖县","钓鱼岛","其它地区"],
	["贵阳市","六盘水市","遵义市","毕节地区","铜仁地区","安顺市","黔东南苗族侗族自治州","黔南布依族苗族自治州","黔西南布依族苗族自治州","其它地区"],
	["昆明市","曲靖市","玉溪市","丽江市","昭通市","普洱市","临沧市","保山市","德宏傣族景颇族自治州","怒江傈傈族自治州","迪庆藏族自治州","大理白族自治州","楚雄彝族自治州","红河哈尼族彝族自治州","文山壮族苗族自治州","西双版纳傣族自治州","其它地区"],
	["拉萨市","那曲地区","昌都地区","林芝地区","山南地区","日喀则地区","阿里地区","其它地区"],
	["西安市","延安市","铜川市","渭南市","咸阳市","宝鸡市","汉中市","榆林市","商洛市","安康市","其它地区"],
	["兰州市","嘉峪关市","金昌市","白银市","天水市","酒泉市","张掖市","武威市","庆阳市","平凉市","定西市","陇南地区","临夏回族自治州","甘南藏族自治州","玉门市","敦煌市","其它地区"],
	["西宁市","海东地区","海北藏族自治州","海南藏族自治州","黄南藏族自治州","果洛藏族自治州","玉树藏族自治州","海西蒙古族藏族自治州","其它地区"],
	["银川市","石嘴山市","吴忠市","固原市","中卫市","其它地区"],
	["乌鲁木齐市","克拉玛依市","石河子市","喀什地区","阿克苏地区","和田地区","吐鲁番地区","哈密地区","克孜勒苏柯尔克孜自治州","博尔塔拉蒙古自治州","昌吉回族自治州","巴音郭楞蒙古自治州","伊犁哈萨克自治州","阿拉尔市","塔城地区","阿勒泰地区","图木舒克市","五家渠市","其它地区"],
	["九龙城区","中西区","东区","观塘区","南区","深水埗区","黄大仙区","湾仔区","油尖旺区","离岛区","葵青区","北区","西贡区","沙田区","屯门区","大埔区","荃湾区","元朗区","其它地区"],
	["澳门半岛","凼仔岛","路环岛","其它地区"],
	["保密"]
];

function _initCity()
{
	var prov_id,city;
	try{
		if( $('#prov')==null ) return;
		prov_id = $('#prov').val();
		prov_id = typeof(prov_id)=='undefined' || prov_id==""?0:prov_id;
		city = $('#city').attr('_city');
		city = typeof(city)=='undefined'?"":city;
	}catch(e){ return;}
	//var city = $('city').readAttribute('_city');
	var citys = _citys[prov_id];
	
	$('#city').empty();
	for(var i=0;i<citys.length;i++){
		var optionStr = (citys[i] == city)?"<option value='"+citys[i]+"' selected='selected'>"+citys[i]+"</option>":"<option value='"+citys[i]+"'>"+citys[i]+"</option>"; 
		$('#city').append(optionStr);
	}
}

